tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "remind101/formulae"
tap "nodenv/nodenv"

############################################################
# *nix
############################################################
brew "ack"
brew "openssl@1.1"
brew "openssh"
brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "bat"
brew "cheat"
brew "findutils"
brew "freetype"
brew "fzf"
brew "gawk"
brew "gnu-tar"
brew "gnu-sed"
brew "mas"
brew "grep"
brew "ssh-copy-id"
brew "tree"
brew "watch"
brew "wget"
brew "ngrep"
brew "p7zip"
brew "shellcheck"
brew "dnsmasq"
brew "jq"
brew "vim"
brew "sshuttle"

############################################################
# Version Control
############################################################
brew "git"

############################################################
# Documentation
############################################################
brew "markdown"
brew "adr-tools"

############################################################
# Langauges
############################################################
brew "go"
brew "jenv"
brew "maven"
brew "gradle"
brew "groovy"
brew "nodenv"
brew "node-build"
brew "rbenv"
brew "ruby-build"
brew "python"

############################################################
# Docker
############################################################
brew "docker"
brew "docker-compose"

############################################################
# Cloud Provisioning
############################################################
brew "packer"
brew "terraform"
brew "terraform_landscape"

############################################################
# AWS 
############################################################
brew "awscli"
brew "aws-iam-authenticator"
brew "sops"
brew "remind101/formulae/assume-role"

############################################################
# Kubernetes
############################################################
brew "kops"
brew "kubernetes-cli"
brew "helm"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"


brew "lastpass-cli"

############################################################
# Applications
############################################################
#cask "1password"
cask "alfred"
cask "bartender"
cask "beyond-compare"
cask "caffeine"
cask "google-chrome"
cask "docker"
cask "drawio"
cask "firefox"
cask "gimp"
cask "iterm2"
cask "java"
cask "little-snitch"
cask "macdown"
cask "postman"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "lastpass"

cask "atom"
cask "intellij-idea"
brew "jetbrains-npm"
cask "visual-studio-code"
cask "webstorm"